code/openfoam/tutorials/incompressibleVoF/capillaryRise/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        zonal;

    defaultValue    0;

    zones
    {
        water
        {
            type            box;

            box             (0 0 -1) (1 8e-3 1);

            value           1;
        }
    }
}

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
    }

    atmosphere
    {
        type            zeroGradient;
    }

    walls
    {
        type           contactAngle;
        theta0         45;
        limit          gradient;
        value          uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
